app/controllers/v1/admins_controller.rb

    def create
        token = Authentication.create_random_token
        admin  = Admin.new
        admin.token = token
        if admin.save
---
INSERT INTO "admins" ("token") VALUES ($1) RETURNING "id"  [["token", "0795e418-100f-41d9-a684-f6900f515379"]]