app/controllers/v1/users_controller.rb

    def create
        user = User.new(user_param)
        if user.save
---
INSERT INTO "users" ("name", "username", "email", "address") VALUES ($1, $2, $3, $4) RETURNING "id"  [["name", "Leanne Graham"], ["username", "Bret"], ["email", "Sincere@april.biz"], ["address", "{\"street\"=>\"Kulas Light\", \"city\"=>\"Gwenborough\"}"]]

    def destroy
        if User.destroy_all
---
DELETE FROM "users" WHERE "users"."id" = $1  [["id", 1]]